{
	"version": "https://jsonfeed.org/version/1",
	"title": "logic2Design",
	"icon": "https://micro.blog/logic2Design/avatar.jpg",
	"home_page_url": "https://logic2design.micro.blog/",
	"feed_url": "https://logic2design.micro.blog/feed.json",
	"items": [
		
			{
				"id": "http://logic2design.micro.blog/2023/10/29/finding-james-spencer.html",
				"title": "Finding James Spencer",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p>I have had a passion for tracing my family tree for some years. On my father’s paternal side, I can trace the Dunn family back to the 1500s. On my mother’s paternal side, I hit a roadblock with her father, <em>James Spencer</em>.</p>\n<p>James came to Western Australia from Scotland in 1921 after serving as a Private in the British Army from 1909 to 1921. He married my grandmother,<em> Louisa Collins,</em> in Perth in 1924. They had two children, Hazel, my mother, and Jean.</p>\n<p>James worked on sheep stations, as a cook in hotels and as a gardener. When World War 2 came around, he enlisted in the Australian Army and served from 1939 until 1947, achieving the rank of Corporal.</p>\n<p>James passed away in 1951, 14 years before I was born.</p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"James Spencer Circa 1950.png\" src=\"https://logic2design.micro.blog/uploads/2023/james-spencer-circa-1950.png\" alt=\"James Spencer circa 1950\" width=\"279\" height=\"450\" border=\"0\" /></p>\n<p>In World War 1, James served in several theatres, including Eqypt, The Dardanelles and France. James received a head wound at <a href=\"https://en.wikipedia.org/wiki/Gallipoli_campaign\">Gallipoli</a> in 1914 and was evacuated to France to recover.</p>\n<blockquote>\n<p>As a side note, having a family member who fought at Gallipoli is a source of pride for an Australian, though unfortunately, he was not an <a href=\"https://en.wikipedia.org/wiki/Australian_and_New_Zealand_Army_Corps\">ANZAC</a>.</p>\n</blockquote>\n<p>In 1930, he lodged a claim for a British Army pension due to the ongoing effects he suffered from the wounding, basically loss of hearing and dizziness and problems with his feet from fighting in the trenches in France, ultimately, the application was turned down. To evaluate his claim, all of his British Army records were sent to Australia.  The records then ended up in the Australian National Archives.</p>\n<p>On James’s Wedding Certificate, it states he was born in Glasgow, Scotland, in 1896. It lists his father as <em>James Spencer</em>, a Shipyard Worker, and his mother as <em>Margaret Webster.</em></p>\n<p>His Death certificate records his father as being <em>James Spencer</em>, a dairy farmer, and his mother as<em> Margaret Webster</em>. His place of birth was Dundee, Scotland, and his birth year was 1885.</p>\n<p>Generally, with the information available on these certificates, it would be fairly easy to trace his family via Birth, Wedding or Death Certificates and Census information. In James’s case, I could get nowhere. I could not locate his birth certificate or a wedding certificate for <em>James Spencer</em> and <em>Margaret Webster</em>.</p>\n<p>Luckily, I could access his British Army records at the National Archives. I hoped to get additional information on James to help me trace him. But the result was actually more confusion as James listed 3 different places and dates of birth.</p>\n<p>Apart from the information I gleaned from the Army records on his extensive military action and physical characteristics (he was only 5’2’), I found details on his vices, drinking, gambling, and absence without leave.  Unfortunately, I also saw treatment for socially induced ailments that a Grandson could have gone without knowing 😀.  All in all, I got the impression he was a loveable rogue who didn't shirk his duty to serve his country, and I really feel slighted not to have had the opportunity to know him.</p>\n<p>The Army records also mentioned that his next of kin was his wife but did not mention her name, just a c/- address, <em>Mrs E Burgess</em> in Dundee, Scotland. This was a surprise but gave me some additional hope as if he was married, there would be a marriage certificate that may provide additional information to help trace him. I had a thought that maybe James had married a daughter of Mrs Burgess. Unfortunately, my search again came up empty.  </p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"James Spencer - Australian Army Regiment.jpeg\" src=\"https://logic2design.micro.blog/uploads/2023/james-spenceraustralian-army-regiment.jpeg\" alt=\"James Spencer  Australian Army Regiment\" width=\"500\" height=\"393\" border=\"0\" /></p>\n<p>At about this time, I engaged a couple of professional Genealogists in Scotland to see if they could assist. Both came back within days and said that they could not help.</p>\n<p>One avenue that I thought may assist was if I could obtain additional information from his <a href=\"https://kosb.co.uk/museum/\">regiment museum</a>, the <a href=\"https://en.wikipedia.org/wiki/King%27s_Own_Scottish_Borderers\">King’s Own Scottish Borderers</a> (KOSB) in <a href=\"https://en.wikipedia.org/wiki/Berwick-upon-Tweed\">Berwick-upon-Tweed,</a> England. Unfortunately, they had stopped assisting with family tree enquiries.</p>\n<p>I kept looking for any potential leads for the next few years but got no further.</p>\n<p>When visiting my Aunt Jean in Margaret River, I would ask questions about her father to see if I could glean some valuable information. Aunty Jean advised that her father celebrated his birthday on the 3rd of September. I am not sure why it took so long, but in one of my last visits with her, before she passed away in 2022 at the age of 94, she provided two bits of information that would reset my search parameters.</p>\n<blockquote>\n<p>“I think he or his father changed their name from MacPherson” and “Margeret Webster may be his stepmother.”</p>\n</blockquote>\n<p>With this information, I was back to square one. If he had changed his surname, did he also change his first name? Basically, I was uncertain of his name, place of birth, date of birth and parents.</p>\n<p>The mention of MacPherson twigged my memory as James had recorded his previous employer  on one of his British Army enlistment papers as being “<em>Colin MacPherson</em>, Market Gardener, Deceased.”</p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"James Louisa and Jean Spencer.png\" src=\"https://logic2design.micro.blog/uploads/2023/james-louisa-and-jean-spencer.png\" alt=\"James Louisa and Jean Spencer\" width=\"599\" height=\"362\" border=\"0\" /></p>\n<p> </p>\n<p>In early 2023, I noticed on the website of the KOSB Museum that they were now providing family tree research assistance. I sent off my request, and I eventually got a reply advising that they had James’s discharge statement from the British Army.  I was then advised that the information could be collected, but there was the issue of the museum closing in August for 3 years due to renovations. </p>\n<p>I was already planning to visit Woodstock, Illinois, to attend the annual <a href=\"https://macstockconferenceandexpo.com/\">Macstock</a> convention in late July, so I arranged my itinerary so I could get to the Museum on Friday, the 28th of July.</p>\n<p>While waiting to take my trip, I engaged the services of the Research Team at the <a href=\"https://tayvalleyfhs.org.uk/\">Tay Valley Family History Society</a> to see if they could assist in locating my grandfather. They conducted a lot of research and came to the same conclusion that he could not be traced based on the available information. They were now invested in the search and were waiting to see what information I could obtain from the KOSB Museum.</p>\n<p>I attended the KOSB museum and collected the available information. Most of the information I had already obtained regarding his service in the Army, the one new piece of information, was the mention of a marriage to Jemima Burgess in Dundee on 5 October 1915 on his discharge papers.</p>\n<p>After leaving the museum, I was driving up to Inverness to do some Nessie hunting (unsuccessful😀 ) so I emailed the new information to the Research Team. By the time I arrived at Inverness, I had an email that provided the breakthrough that I had been searching for.</p>\n<p>They had checked <a href=\"https://www.scotlandspeople.gov.uk/\">Scotlands People </a>(the Scottish Government site for searching government records and archives) for a Marriage Certificate between <em>James Spencer</em> and <em>Jemima Burgess</em>. That search was unsuccessful, but they did find a marriage on the same day between <em>John Robertson MacPherson</em> and <em>Jemima Burgess</em>. Jemima lived at 26 Mid Street Dundee, the same address James had listed as the C/- address for his unnamed wife.</p>\n<p><em>John MacPherson</em> listed his father as <em>Colin MacPherson</em>, Market Gardener, Deceased, and his mother as <em>Margaret MacPherson,</em> maiden name <em>Robertson</em>. He also stated his occupation as being a Private in the King’s Own Scottish Borderers.</p>\n<p>A search of Scottish Birth and Census records shows that in <em>Colin</em> <em>MacPherson</em> was actually John/James’s Grandfather. His mother was <em>Margaret MacPherson</em>, the daughter of Colin. Colin’s wife was <em>Agnes Webster</em>. Either on purpose or by confusion, James had mixed up his mother’s and Grandmother's names to use <em>Margeret Webster</em> on his Marriage Certificate.</p>\n<p>John Macpherson’s birth certificate confirms his date of birth to be 3 September 1884 and his place of birth to be Dundee. It lists <em>Margaret MacPherson</em> as his mother, with no name for his father. I am taking a punt that John’s middle name, Robertson, is likely his father's Surname. Of interest is in the 1881 Census, the MacPhersons lived in the same house as a Robertson family. I am hoping DNA may eventually confirm this theory.</p>\n<p>A search on <a href=\"https://www.fold3.com\">Fold3</a> for military records for John MacPherson came up with this index card from the Western Front Association archive.</p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"John Macpherson British Army Index Card.png\" src=\"https://logic2design.micro.blog/uploads/2023/john-macpherson-british-army-index-card.png\" alt=\"John Macpherson British Army Index Card\" width=\"299\" height=\"234\" border=\"0\" /></p>\n<p>It would appear that the British Army were aware of James's true identity. All of the Regiments listed are the same as recorded under James Spencer’s index card. It is strange in the 100+ pages of records that I accessed at the National Archive, this was never mentioned; it would have saved a lot of time.</p>\n<p>Jemima eventually filed for Divorce from John Macpherson (address unknown) in 1938. I wonder what the reason was for the breakdown of the marriage. I feel sorry for Jemima for the position I imagine she was left in when James left for Australia. I will be undertaking further research to try and gain insight into her life.</p>\n<p>It may have taken years, but the effort was worthwhile as I now have a better understanding of my grandfather, James and his background. I can also add Bigamy to his list of vices 😀.</p>\n<p>Though for the many answered questions, I now have more questions to pursue. Fortunately, as time goes by, more and more information gets digitised, more people post details of their family tree, and more DNA tests get taken; it's not always easy, but researching your family tree can be very rewarding.</p>\n",
				"date_published": "2023-10-29T17:35:10+08:00",
				"url": "https://logic2design.micro.blog/2023/10/29/finding-james-spencer.html",
				"tags": ["Genealogy"]
			},
			{
				"id": "http://logic2design.micro.blog/2023/01/20/chatgpt-siri-shortcut.html",
				"title": "ChatGPT Siri Shortcut",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>I created this Shortcut to interact with ChatGPT.</p>\n\n<p>There are options to display or speak the results, add follow-up questions and share the final results by email, message etc. You just need to add your own <a href=\"https://help.openai.com/en/articles/4936850-where-do-i-find-my-secret-api-key\">OpenAI API Key</a>.</p>\n\n<p><a href=\"https://www.icloud.com/shortcuts/f1eec0fdad1d4f48ac1d868601b23a62\">iCloud Shortcut link</a></p>\n\n<p><img style=\"display:block; margin-left:auto; margin-right:auto;\" src=\"https://logic2design.micro.blog/uploads/2023/fb842b0fc0.png\" alt=\"Siri Chat GPT\" title=\"Siri Chat GPT.png\" border=\"0\" width=\"599\" height=\"498\" /></p>\n",
				"date_published": "2023-01-20T10:04:38+08:00",
				"url": "https://logic2design.micro.blog/2023/01/20/chatgpt-siri-shortcut.html",
				"tags": ["Code","Automation","AI"]
			},
			{
				"id": "http://logic2design.micro.blog/2023/01/06/apple-music-to.html",
				"title": "Apple Music to Obsidian",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>As a new years resolution, I decided to give <a href=\"https://obsidian.md/\">Obsidian</a> another go; so far I am impressed with how the plugin ecosystem has developed since my last attempt to use the app.</p>\n\n<p>One of the categories of data I want to capture in my <a href=\"https://www.buildingasecondbrain.com/\">2nd Brain</a> is music that I like. </p>\n\n<p>The goal of automating this process is to streamline the workflow and make it easier to get all of this information into Obsidian without having to manually copy and paste everything.</p>\n\n<p>There is a plugin called <a href=\"https://github.com/mProjectsCode/obsidian-media-db-plugin\">Obsidian Media DB</a> that is very useful, but ultimately there are gaps in the metadata that it will capture, resulting in me building my own approach. To accomplish this, I created a Shortcut to capture metadata relating to the current song playing in Apple Music.\n<ul>\n <li><a href=\"https://www.icloud.com/shortcuts/2b1a12bcfd18450693af31f546edf4ee\">Shazam It to Obsidian</a> - captures the song being played via <a href=\"https://support.apple.com/en-au/HT210331\">Shazam</a> recognition</li>\n</ul></p>\n\n<p>The Shortcut will create a new note about the song incorporating the metadata that I require to create an archive of music.</p>\n\n<p><img style=\"display:block; margin-left:auto; margin-right:auto;\" src=\"https://logic2design.micro.blog/uploads/2023/89c1659935.png\" alt=\"Music metadata\" title=\"Play Some D by Brassy.png\" border=\"0\" width=\"600\" height=\"432\" /></p>\n\n<p>With the use of the <a href=\"https://blacksmithgu.github.io/obsidian-dataview/\">Dataview</a> plugin and the <a href=\"https://github.com/kepano/obsidian-minimal\">Minimal theme</a> I can create a dashboard of the captured song data that also allows me to play the song directly from Apple Music.</p>\n\n<p><img style=\"display:block; margin-left:auto; margin-right:auto;\" src=\"https://logic2design.micro.blog/uploads/2023/34b5de074c.png\" alt=\"Music Gallery\" title=\"Obsidian Music Gallery.png\" border=\"0\" width=\"600\" height=\"547\" /></p>\n\n<blockquote>---\ncssClasses: cards, cards-cover, cards-1-1, table-max\ntags: music\n---\n```dataview\nTABLE WITHOUT ID\nlink(file.link,title) as \"Title\",artist as Artists, (\"![|100](\" + cover + \")\")  as Cover,year as Year,\ngenre as Genre,(\"[▶️](\" + url + \")\") as Play\nFROM \"Media/Music\"\nSORT artist asc\n```</blockquote>\n\n<p>As part of the process, I also save the song to a Playlist within Apple Music.</p>\n\n<p>It is early days as yet, but I am liking Obsidian&#8217;s ability to quickly capture and catalogue music, movies, TV series, books and webpage information.</p>\n\n<p>Automating the process of capturing data for use in Obsidian can save you a lot of time and effort and make it easier to keep your vault organised and up-to-date. Whether you use plugins, Shortcuts or custom code, there are plenty of options available for streamlining this process.</p>\n\n<p>Find more automation workflows at <a href=\"https://www.logic2design.com\">logic2Design.com</a>.</p>\n",
				"date_published": "2023-01-06T14:54:48+08:00",
				"url": "https://logic2design.micro.blog/2023/01/06/apple-music-to.html",
				"tags": ["Code","Automation","Music"]
			},
			{
				"id": "http://logic2design.micro.blog/2022/12/13/i-just-finished.html",
				
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>I just finished the Blind Smartphone Camera Test 2022, here are my results:\nCategory: Standard</p>\n\n<p>🥇: G\n🥈: O\n🥉: I</p>\n\n<p>Get your results at vote.mkbhd.com</p>\n",
				"date_published": "2022-12-13T05:39:44+08:00",
				"url": "https://logic2design.micro.blog/2022/12/13/i-just-finished.html",
				"tags": ["Technology"]
			},
			{
				"id": "http://logic2design.micro.blog/2022/12/10/family-tree-documentation.html",
				"title": "Family Tree documentation automatic rename and file via Hazel",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>While researching my family tree, I have gathered a large collection of documentation and media files. I like to file them consistently to allow for easy access. The naming convention I have settled on is</p>\n\n<ul>\n<li>Document Type</li>\n<li>Document Year</li>\n<li>Family Name</li>\n<li>Given Names(s)</li>\n<li>Notes</li>\n</ul>\n\n<p>To automate the process, I created a <a title=\"Noodlesoft's Hazel\" href=\"https://www.noodlesoft.com\">Hazel Rule</a> that prompts for the various information categories, then renames the file, moving it to a centralised folder and filing it into a <em>Family Name-Document Type</em> structure.</p>\n\n<p>For future reference, I store the URL of the site the information was downloaded from as a Comment.</p>\n\n<figure><img src=\"uploads/2022/789afceba2.png\" alt=\"\" /></figure>\n\n<p>A video of the process can be viewed here.</p>\n\n<p>{{< youtube dc_BgJ6AmAY >}}</p>\n\n<p>A copy of the Hazel rule can be downloaded via this <a title=\"Hazel Rules\" href=\"http://d.pr/f/QkdzCH\">link</a>.</p>\n",
				"date_published": "2022-12-10T08:31:40+08:00",
				"url": "https://logic2design.micro.blog/2022/12/10/family-tree-documentation.html",
				"tags": ["Code","Genealogy"]
			},
			{
				"id": "http://logic2design.micro.blog/2022/12/10/business-cards-to.html",
				"title": "Business Cards to Devonthink",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>This routine will detect scanned business cards then via a <a href=\"https://www.noodlesoft.com/\" title=\"Hazel\">Hazel </a>rule prompt for a new name and then automatically file away in the nominated location in <a href=\"http://www.devontechnologies.com/products/devonthink/overview.html\" title=\"Devonthink\">Devonthink.</a></p>\n\n<ol>\n<li>Scan Business Card to Folder</li>\n<li>Run this Hazel <a href=\"https://d.pr/f/Kn8dKP\" title=\"Hazel Rule\">rule</a> on the Folder</li>\n<li>Preview will open, showing you the Business Card</li>\n<li>You will be prompted for a name for the Business Card</li>\n<li>Preview will close</li>\n<li>Business Card will be filed to the nominated Database and Folder in Devonthink Pro.</li>\n</ol>\n\n<figure>\n<img src=\"https://cdn.uploads.micro.blog/93701/2022/7d1bfbe106.png\" alt=\"\" />\n</figure>\n\n<figure>\n<img src=\"https://cdn.uploads.micro.blog/93701/2022/26de376817.png\" alt=\"\" />\n</figure>\n\n<figure>\n<img src=\"https://cdn.uploads.micro.blog/93701/2022/84ab00a097.png\" alt=\"\" title=\"Applescript\" />\n</figure>\n\n<figure>\n<img src=\"https://cdn.uploads.micro.blog/93701/2022/c9b7db8fde.png\" alt=\"\" title=\"File to Devonthink\" />\n</figure>\n\n<figure>\n<img src=\"https://cdn.uploads.micro.blog/93701/2022/43616abca1.png\" alt=\"\" />\n</figure>\n\n<p>The Hazel rule can be downloaded <a href=\"https://d.pr/f/Kn8dKP\" title=\"Hazel Rule\">here</a>.</p>\n",
				"date_published": "2022-12-10T07:05:01+08:00",
				"url": "https://logic2design.micro.blog/2022/12/10/business-cards-to.html",
				"tags": ["Code","Automation"]
			},
			{
				"id": "http://logic2design.micro.blog/2022/12/08/having-lots-of.html",
				
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>Having lots of fun with #ChatGPT. Was impressed with this result</p>\n\n<p><img src=\"uploads/2022/8f561ad299.png\" alt=\"\" width=\"600\" height=\"453\" /></p>\n",
				"date_published": "2022-12-08T17:20:56+08:00",
				"url": "https://logic2design.micro.blog/2022/12/08/having-lots-of.html",
				"tags": ["AI"]
			},
			{
				"id": "http://logic2design.micro.blog/2022/12/08/currently-reading-building.html",
				
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "<p>Currently reading: <a href=\"https://micro.blog/books/9781982167400\">Building a Second Brain: A Proven Method to Organize Your Digital Life and Unlock Your Creative Potential</a> by Tiago Forte 📚</p>\n\n<p>Excellent source of ideas to organise your digital life.</p>\n",
				"date_published": "2022-12-08T16:57:32+08:00",
				"url": "https://logic2design.micro.blog/2022/12/08/currently-reading-building.html",
				"tags": ["Books"]
			}
	]
}
